import pandas as pd


# 存放固定的df
class Constants:

    # @staticmethod
    # def get_group_unit_df():
    #     return group_unit_df

    @staticmethod
    def get_units_quotation_df():
        return units_quotation_df

    @staticmethod
    def get_fm_quotation_df():
        return fm_quotation_df

    @staticmethod
    def get_spinning_reserve_df():
        return spinning_reserve_df


# # 集团机组对应表
# group_unit_df = pd.DataFrame(columns=['集团', '机组名称', '编码'])
# group_unit_df['集团'] = [
#     '赣能', '赣能', '赣能', '赣能', '赣能', '赣能',
#     '国家能源', '国家能源', '国家能源', '国家能源', '国家能源', '国家能源', '国家能源', '国家能源', '国家能源', '国家能源', '国家能源',
#     '国家电投', '国家电投', '国家电投', '国家电投', '国家电投', '国家电投', '国家电投', '国家电投', '国家电投', '国家电投', '国家电投',
#     '华能', '华能', '华能', '华能', '华能', '华能', '华能', '华能', '华能', '华能',
#     '大唐', '大唐'
# ]
# group_unit_df['机组名称'] = [
#     '信丰#1', '信丰#2', '丰二#5', '丰二#6', '丰三#7', '丰三#8',
#     '浔阳#1', '浔阳#2', '九江#5', '九江#6', '九江#7', '黄金埠#1', '黄金埠#2', '丰一#1', '丰一#2', '丰一#3', '丰一#4',
#     '新昌#1', '新昌#2', '景德镇#1', '景德镇#2', '分宜#9', '双林#1', '双林#2', '贵二#5', '贵二#6', '贵三#1', '贵三#2',
#     '井一#1', '井一#2', '井二#3', '井二#4', '安源#1', '安源#2', '瑞一#1', '瑞一#2', '瑞二#3', '瑞二#4',
#     '抚州#1', '抚州#2'
# ]
# group_unit_df['编码'] = [
#     'XF1', 'XF2', 'FC5', 'FC6', 'FC7', 'FC8',
#     'XY1', 'XY2', 'JJ5', 'JJ6', 'JJ7', 'HJB1', 'HJB2', 'FC1', 'FC2', 'FC3', 'FC4',
#     'XC1', 'XC2', 'JDZ1', 'JDZ2', 'FY9', 'SL1', 'SL2', 'GX5', 'GX6', 'GX1', 'GX2',
#     'JGS1', 'JGS2', 'JGS3', 'JGS4', 'AY1', 'AY2', 'RJ1', 'RJ2', 'RJ3', 'RJ4',
#     'FZ1', 'FZ2'
# ]
# group_unit_df['机组容量'] = [
#     660, 660, 700, 700, 1000, 1000,
#     1000, 1000, 350, 350, 660, 650, 650, 340, 340, 340, 340,
#     700, 700, 660, 660, 330, 660, 660, 300, 300, 640, 640,
#     300, 300, 660, 660, 660, 660, 350, 350, 1000, 1000,
#     1000, 1000
# ]

# 机组报价表
units_quotation_df = pd.DataFrame(columns=['机组名称', '机组容量(MW)', '出力1', '报价1', '出力2', '报价2', '出力3', '报价3',
                            '出力4', '报价4', '出力5', '报价5', '出力6', '报价6', '出力7', '报价7', '出力8',
                            '报价8', '出力9', '报价9', '出力10', '报价10'], index=range(1))

# 调频报价
fm_quotation_df = pd.DataFrame(columns=['机组名称', '调频指标K', '调频统一报价',
                                               '调频报价1', '调频报价2', '调频报价3', '调频报价4', '调频报价5', '调频报价6',
                                               '调频报价7', '调频报价8', '调频报价9', '调频报价10', '调频报价11', '调频报价12',
                                               '调频报价13', '调频报价14', '调频报价15', '调频报价16', '调频报价17', '调频报价18',
                                               '调频报价19', '调频报价20', '调频报价21', '调频报价22', '调频报价23', '调频报价24',
                                               ], index=range(10))

# 旋转备用
spinning_reserve_df = pd.DataFrame(columns=['机组名称', '旋备容量(MW)'], index=range(10))
